#include "Touch.h"


/********************************************************************************/
 u16	xdata TK_cnt[4];	  // 键计数值
 u16	xdata TK_zero[4];	  // 0点读数 
 u16	KeyState;		        //键状态
 u8	Keynum;		            //键码 0-3
 bit	B_ReadKeyOk;	      // 触摸按键转换完成标志位
 u8	TrigLimit;		        //触发转换限时 
 u8 i;
 u16 code T_KeyState[4]  = {0x0001,0x0002,0x0004,0x0008};
 u16 code T_KeyPress[4]  = {500,500,300,400};
 u16	j;

/********************************************************************************/ 
 
 
void Touch_Init()    // 触摸按键初始化设置
{
	P_SW2 |= 0x80;	               //使能 XFR 访问
  TSRT = 0x00;		               //没有LED分时扫描
	TSCHEN1 = 0x0f;		             //TK0~TK7 
	TSCHEN2 = 0x00;		             //TK8~TK15
	TSCFG1  = (7<<4) + 1;	         //开关电容工作频率 = fosc/(2*(TSCfg1[6:4]+1)), 放电时间(系统时钟周期数) 0(125) 1(250) 2(500) 3(1000) 4(2000) 5(2500) 6(5000) 7(7500) 最小3
	TSCFG2  = 0;		               //配置触摸按键控制器的内部参考电压(AVCC的分压比), 0(1/4)  1(1/2)  2(5/8)  3(3/4)
	IE2 |= 0x80;		               //允许触摸按键中断
	EA = 1;                        //打开总中断

	delay_ms(20);                  // 留一点时间触摸配置完成
	for(i=0; i<4; i++)	
	 TK_zero[i] = TK_cnt[i];    //保存0点，要求上电不要触碰按键
	KeyState = 0;               // 上一次按键状态
	B_ReadKeyOk = 0;            // 触摸按键转换完成标志位，初始化0
	Keynum = 0;                 // 按键号
}
/********************************************************************************/ 
 
//触摸按键循环检测
void TouchKey_Value()
{	
 //delay_ms(1);
	if(++TrigLimit >= 50)	          //触发转换
	{
		TrigLimit = 0;		
		TSCTRL = (1<<7) + (1<<6) +1;	//开始扫描, 2次平均, 读数大约为无平均的一半
	}
	if(B_ReadKeyOk == 1)			      // 4个键都转换完毕
	{
		B_ReadKeyOk = 0;
		TrigLimit = 50;	
		j = KeyState;		              //读入上一次键状态
		for(i=0; i<4; i++)
		{
			if(TK_zero[i] > TK_cnt[i])	//计算与0点的差值
			{
				TK_zero[i]--;	//缓慢0点跟随
				if((TK_zero[i] - TK_cnt[i]) >= T_KeyPress[i]/2)	
					KeyState |=  T_KeyState[i];	// 大于按键读数变量的1/2就是按下  ， 修改按键的灵敏度，可尝试改此处
				else if((TK_zero[i] - TK_cnt[i]) <= T_KeyPress[i]/3)	
					KeyState &= ~T_KeyState[i];	// 小于按键读数变量的1/3就是释放  ， 修改按键的灵敏度，可尝试改此处
			}
			else
			{
				KeyState &= ~T_KeyState[i];
				if((TK_cnt[i] - TK_zero[i]) > 100)	
					TK_zero[i] += 50;	//差别很大, 则快速回0点
				else							
					TK_zero[i] += 10;	//差别不大, 则慢速回0点
			}
		}
		
		j = (j ^ KeyState) & KeyState;	//检测键是否按下，j != 0 ,有按键按下
		Keynum = CheckKey(j);	          //计算键码 0-3		
		if(j != 0)    // 有触摸按键按下	                       
		{
			 Beep_shortSound();      // 触摸按键有按下的蜂鸣器就响一下
			 if(Keynum == 0)         // 模式按键
			 {
				 Modenum++;
				 if(Modenum == 8)
					 Modenum = 0;
			   ShowValue_A(37,38,30,Modenum,31,31,31,31);  // 显示当前模式:SE-X
         ShowValue_B(31,31,31,31,31,31);				 
			 }
/********************************************************************************/	
	 
// 模式 0，按 EN 键可报时，按 SET键返回模式界面		
			if(Modenum == 0)        
			 {	
				 if(Keynum == 2)
					 {	
             Soundchime();
					 }		 					 		 
			 }

/********************************************************************************/	
			 
 // 模式 1，按 EN 键进入设置，按 +，— 调节亮度，按 SET 键直接保存并返回模式界面		 
		 if(Modenum == 1)       
				 Mode_1();				 
			 
		 if(Modenum != 1)    // 退出模式1 ，则标志位清零
			 Modenum1_bit = 0;
		 
/********************************************************************************/				 
			 
// 模式 2，按 EN 键选择需要调节的时间，按 + — 键 调节数值，按 SET键直接保存并返回模式界面			 
		  if(Modenum == 2)        
				 Mode_2();		

			 if(Modenum != 2)    // 退出模式2 ，则标志位清零, 保存已经设定的
				 {
					 Modenum2_bit = 0;
					 numtime_adjust = 5;	  // 下次进入 时间调节界面，从 年 开始调节
				 }
/********************************************************************************/		

 // 模式 3，按 EN 键进入闹钟调节界面，按 SET 键退出并返回模式界面		

			 if(Modenum == 3)       	
         Mode_3();				 
			 
			 if(Modenum != 3)    // 退出模式3 ，则标志位清零
			 {
				 Modenum3_bit = 0;	
			   numclock_adjust = 4;	  // 下次进入 时间调节界面，从 闹钟 X 开始调节
			 }				 
		 
	
/********************************************************************************/							 

// 模式 4 ，按 EN 键进入温度显示界面，按 SET 键退出并返回模式界面		 
			 
			 if(Modenum == 4)       	
         Mode_4();				 
			 
			 if(Modenum != 4)    // 退出模式4 ，则标志位清零
			   Modenum4_bit = 0;		

/********************************************************************************/		

 // 模式 5，按 EN 键进入 电量显示界面，按 SET 键退出并返回模式界面
			 if(Modenum == 5)     
				 Mode_5();
			  			 
			 if(Modenum != 5)    // 退出模式5 ，则标志位清零
			   Modenum5_bit = 0;	
			 
/********************************************************************************/			

 // 模式 6，按 EN 键 缓慢息屏，按 SET键退出息屏状态，进入模式界面	
			 if(Modenum == 6)     
				 Mode_6();

 /********************************************************************************/	
			 
 // 模式 7，按 EN 键 再调整加和减，声音依次输出	
			 if(Modenum == 7)     
				 Mode_7();
			 
			 if(Modenum != 7)    // 退出模式7 ，则标志位清零
			   Modenum7_bit = 0;				 
			 
/********************************************************************************/						 
		}		
	}	
}

 
void  delay_ms(u8 ms)   //延时函数 
{
	u16 i;
	do
	{
		i = MAIN_Fosc / 10000;
		while(--i)	;
	}
	while(--ms);
}

void Delay3000ms()		 //@11.0592MHz   3s 开机动画时间
{
	unsigned char data i, j, k;

	_nop_();
	_nop_();
	i = 127;
	j = 18;
	k = 107;
	do
	{
		do
		{
			while (--k);
		} while (--j);
	} while (--i);
}

u8	CheckKey(u16 j)  // 检测 计算键码 
{
	u8 i;
	if(j == 0)             //无键按下
		return 0;	          
	for(i=0; i<4; i++)
	{
		if(j & 0x0001)	
		 break;
		j >>= 1;
	}
	return (i);	           //键码 0-3
}

